src/cf/DataProcessors/УдалениеУстаревшихЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УдалениеУстаревшихЦен</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>Валюта цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВключаяХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУстановки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходыПредпринимателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>АПК:93 одинаковое представление и для объекта и для списка</Comment>
			<BasedOn>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document.АвансовыйОтчет</xr:Item>
				<xr:Item>Document.ОприходованиеЗапасов</xr:Item>
				<xr:Item>Document.СборкаЗапасов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьНовыеЦеныПоверхУстановленных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДействующуюЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьЗависимыеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНедействительныеХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьОтклонениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьХарактеристики</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьХарактеристикамБезЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьНовуюЦену</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьНаценку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетИзВидаЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйНовыйФормат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаСтарая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/ПапкиФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПапкиФайлов</Name>
			<Comment>Структура папок для хранения файлов</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/УдалениеУстаревшихЦен/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьПрогресс(ПрогрессУдаления, КоличествоУдаляемых)
	
	ПрогрессУдаления	= ПрогрессУдаления + 1;
	ТекстПрогресса		= СтрШаблон(НСтр("ru ='Удалено %1 из %2 строк...'"), ПрогрессУдаления, КоличествоУдаляемых);
	ДлительныеОперации.СообщитьПрогресс(ОКР(ПрогрессУдаления * 100 / КоличествоУдаляемых, 1), ТекстПрогресса);
	
КонецПроцедуры

Процедура ЗаполнитьШапкуДокументаЛогирования(РезультатУдаления, КоличествоУдаляемыхЗаписей)
	
	РезультатУдаления	= Новый ТабличныйДокумент;
	
	Макет				= ПолучитьМакет("ПФ_MXL_РезультатУдаления");
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ДатаИВремяУдаления	= Формат(ТекущаяДатаСеанса(), "dd.MM.yyyy.hh.mm");
	ТекстЗаголовка 		= СтрШаблон(НСтр("ru ='Удаление цен от %1 в количестве: %2.'"), ДатаИВремяУдаления, КоличествоУдаляемыхЗаписей);
	
	ДанныеПечати		= Новый Структура;
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ДанныеПечати.Вставить("Ответственный", Пользователи.АвторизованныйПользователь());
	
	ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
	РезультатУдаления.Вывести(ОбластьШапка);
	
	РезультатУдаления.Вывести(ОбластьШапкаТаблицы);
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуДокументаЛогирования(РезультатУдаления, ОбластьСтрока, ЗаписьОЦене)
	
	ДанныеПечати = Новый Структура("Период, ВидЦен, ПредставлениеНоменклатуры, ПредставлениеХарактеристики, ЦенаУдаленная");
	
	ДанныеПечати.Период						= ЗаписьОЦене.Период;
	ДанныеПечати.ВидЦен						= ЗаписьОЦене.ВидЦен;
	ДанныеПечати.ПредставлениеНоменклатуры	= ЗаписьОЦене.Номенклатура;
	ДанныеПечати.ПредставлениеХарактеристики= ЗаписьОЦене.Характеристика;
	ДанныеПечати.ЦенаУдаленная				= ЗаписьОЦене.Цена;
	
	ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
	РезультатУдаления.Вывести(ОбластьСтрока);
	
КонецПроцедуры

Процедура ЗаписатьРезультат(РезультатУдаления)
	
	Если РезультатУдаления = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	РезультатУдаления.Записать(ИмяВременногоФайла);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	Попытка
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	Исключение
		
		ЗаписьЖурналаРегистрации("УдалениеСтарыхЦен", УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	ДатаИВремяУдаления = Формат(ТекущаяДатаСеанса(), "ДФ=dd_MM_yy_hh_mm");
	
	ВладелецФайлов = Справочники.ПапкиФайлов.ПолучитьСсылку(Справочники.ВидыЦен.СсылкаНовогоКаталогаЛогированияУдаленияУстаревшихЦен().УИД);
	Если ВладелецФайлов.ПолучитьОбъект() = Неопределено Тогда
		
		Справочники.ВидыЦен.ДобавитьКаталогЛогированияУдаленияСтарыхЦен();
		
	КонецЕсли;
	
	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("Автор",				Пользователи.АвторизованныйПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов",		ВладелецФайлов);
	ПараметрыФайла.Вставить("ИмяБезРасширения",		СтрШаблон(НСтр("ru ='УдалениеЦен_%1'"), СтрЗаменить(ДатаИВремяУдаления, ".", "_")));
	ПараметрыФайла.Вставить("РасширениеБезТочки",	"mxl");
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное");
	
	РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресХранилища);
	
КонецПроцедуры

// Стартовая процедура длительной операции
Процедура УдалитьНеактуальныеЦены(ПараметрыУдаления, АдресХранилища = Неопределено) Экспорт
	
	РезультатУдаления = Неопределено;
	
	Если ПараметрыУдаления.СпособОчисткиЦен = 0 Тогда
		
		УдалитьЦеныСВыключеннымПризнакомАктуальность(ПараметрыУдаления, РезультатУдаления);
		
	ИначеЕсли ПараметрыУдаления.СпособОчисткиЦен = 1 Тогда
		
		УдалитьЦеныКромеПоследних(ПараметрыУдаления, РезультатУдаления);
		
	ИначеЕсли ПараметрыУдаления.СпособОчисткиЦен = 2 Тогда
		
		УдалитьЦеныПоПериодуАктуальности(ПараметрыУдаления, РезультатУдаления);
		
	КонецЕсли;
	
	ЗаписатьРезультат(РезультатУдаления);
	
КонецПроцедуры

#Область МетодыУдаления

Процедура УдалитьЦеныСВыключеннымПризнакомАктуальность(ПараметрыУдаления, РезультатУдаления)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЦеныНоменклатуры.Период КАК Период,
	|	ЦеныНоменклатуры.ВидЦен КАК ВидЦен,
	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
	|	ЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Актуальность = ЛОЖЬ
	|	И ЦеныНоменклатуры.ДокументУстановки = ЗНАЧЕНИЕ(Документ.УстановкаЦенНоменклатуры.ПустаяСсылка)");

	
	Если ПараметрыУдаления.Свойство("ВидыЦен") Тогда
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("ЦеныНоменклатуры.ВидЦен В(&ВидыЦен)");
		
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		Запрос.УстановитьПараметр("ВидыЦен", ПараметрыУдаления.ВидыЦен);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбластьСтрока			= ПолучитьМакет("ПФ_MXL_РезультатУдаления").ПолучитьОбласть("Строка");
	Выборка					= РезультатЗапроса.Выбрать();
	КоличествоУдаляемых		= Выборка.Количество();
	ПрогрессУдаления		= 0;
	
	ЗаполнитьШапкуДокументаЛогирования(РезультатУдаления, КоличествоУдаляемых);
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(Выборка.Период, Истина);
			НаборЗаписей.Отбор.ВидЦен.Установить(Выборка.ВидЦен, Истина);
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура, Истина);
			НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика, Истина);
			
			СообщитьПрогресс(ПрогрессУдаления, КоличествоУдаляемых);
			
			ЗаполнитьСтрокуДокументаЛогирования(РезультатУдаления, ОбластьСтрока, Выборка);
			
			НаборЗаписей.Очистить();
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Ложь, Ложь);
			
		Исключение
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЦеныКромеПоследних(ПараметрыУдаления, РезультатУдаления)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МинимальноеКоличествоЦенНоменклатуры", ПараметрыУдаления.МинимальноеКоличествоЦенНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатуры.ВидЦен КАК ВидЦен,
	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
	|	СУММА(1) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.ДокументУстановки = ЗНАЧЕНИЕ(Документ.УстановкаЦенНоменклатуры.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатуры.ВидЦен,
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.Характеристика
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(1) > &МинимальноеКоличествоЦенНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеныНоменклатуры.ВидЦен,
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.Характеристика";
	
	Если ПараметрыУдаления.Свойство("ВидыЦен") Тогда
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("ЦеныНоменклатуры.ВидЦен В(&ВидыЦен)");
		
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		Запрос.УстановитьПараметр("ВидыЦен", ПараметрыУдаления.ВидыЦен);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбластьСтрока			= ПолучитьМакет("ПФ_MXL_РезультатУдаления").ПолучитьОбласть("Строка");
	Выборка					= РезультатЗапроса.Выбрать();
	КоличествоУдаляемых		= Выборка.Количество();
	ПрогрессУдаления		= 0;
	
	ЗаполнитьШапкуДокументаЛогирования(РезультатУдаления, Выборка.Количество());
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидЦен.Установить(Выборка.ВидЦен, Истина);
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура, Истина);
			НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика, Истина);
			НаборЗаписей.Прочитать();
			
			СообщитьПрогресс(ПрогрессУдаления, КоличествоУдаляемых);
			
			ТаблицаЗаписей = НаборЗаписей.Выгрузить();
			ТаблицаЗаписей.Сортировать("Период Возр");
			
			КоличествоУдаляемыхВСессии = ТаблицаЗаписей.Количество() - ПараметрыУдаления.МинимальноеКоличествоЦенНоменклатуры;
			Пока КоличествоУдаляемыхВСессии > 0 Цикл
				
				ЗаполнитьСтрокуДокументаЛогирования(РезультатУдаления, ОбластьСтрока, ТаблицаЗаписей[0]);
				
				ТаблицаЗаписей.Удалить(ТаблицаЗаписей[0]);
				КоличествоУдаляемыхВСессии = КоличествоУдаляемыхВСессии - 1;
				
			КонецЦикла;
			
			НаборЗаписей.Загрузить(ТаблицаЗаписей);
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Ложь, Ложь);
			
		Исключение
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЦеныПоПериодуАктуальности(ПараметрыУдаления, РезультатУдаления)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПериодДействующихЦен", ПараметрыУдаления.ПериодДействующихЦен);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатуры.ВидЦен КАК ВидЦен,
	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Период < &ПериодДействующихЦен
	|	И ЦеныНоменклатуры.ДокументУстановки = ЗНАЧЕНИЕ(Документ.УстановкаЦенНоменклатуры.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦеныНоменклатуры.ВидЦен,
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.Характеристика";
	
	Если ПараметрыУдаления.Свойство("ВидыЦен") Тогда
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор.Добавить("ЦеныНоменклатуры.ВидЦен В(&ВидыЦен)");
		
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		Запрос.УстановитьПараметр("ВидыЦен", ПараметрыУдаления.ВидыЦен);
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбластьСтрока			= ПолучитьМакет("ПФ_MXL_РезультатУдаления").ПолучитьОбласть("Строка");
	Выборка					= РезультатЗапроса.Выбрать();
	КоличествоУдаляемых		= Выборка.Количество();
	ПрогрессУдаления		= 0;
	
	ЗаполнитьШапкуДокументаЛогирования(РезультатУдаления, Выборка.Количество());
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидЦен.Установить(Выборка.ВидЦен, Истина);
			НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура, Истина);
			НаборЗаписей.Отбор.Характеристика.Установить(Выборка.Характеристика, Истина);
			НаборЗаписей.Прочитать();
			
			СообщитьПрогресс(ПрогрессУдаления, КоличествоУдаляемых);
			
			ИндексЗаписей = 0;
			Пока ИндексЗаписей <= НаборЗаписей.Количество() - 1 Цикл
				
				ЗаписьНабора = НаборЗаписей[ИндексЗаписей];
				
				Если ЗаписьНабора.Период >= ПараметрыУдаления.ПериодДействующихЦен Тогда
					
					ИндексЗаписей = ИндексЗаписей + 1;
					Продолжить;
					
				КонецЕсли;
				
				ЗаполнитьСтрокуДокументаЛогирования(РезультатУдаления, ОбластьСтрока, ЗаписьНабора);
				
				НаборЗаписей.Удалить(ИндексЗаписей);
				
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина, Ложь, Ложь);
			
		Исключение
			
			ВызватьИсключение;
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
